[2016-07-29]:脑子还在蒙圈中，不说了，没时间解释了
[2016-07-29]:上课都能听懂，下课就懵了，
[2016-07-29]:吉特哈脖 桌面版怎么用啊
[2016-07-29]:帅比，把你珍藏的demo给我们点呗～
    - code4app
    - github
    - 微博
    - MAC开发教程
    - Swift MAC开发教程
[2016-07-29]:希望尹哥每天早上能把当天的素材放在一个文件夹里，早上先让大家下载一下，这样上课跟着敲代码的同学就不用四处找素材去了，谢谢！
[2016-07-29]:无
[2016-07-29]:太上心了，太感动了，今晚带你飞，带你去大保健
[2016-07-29]:屏幕广播拖的不合适，缩放显示有点模糊，不缩放有太大页面显示不全
[2016-07-29]:知识点有点杂
[2016-07-29]:单例不是很明白 还有就是为什么layoutsubviews不能直接调用
    - 什么叫单例: 在内存中只有一个这种类的对象,全局都可以调用类方法去获取到该对象
    - 懒汉式: 在用到的时候才加载
    - 饿汉式: 一运行起来时候就加载.
    - layoutsubviews不能直接调用,原因苹果说的.具体见文档
[2016-07-29]:尹哥，最好能用一小段时间回顾下四种线程巩固下，知识点散，不太好记忆
[2016-07-29]:gcd一次操作 oncetoken 除了0和1 怎么还会有还会有很大的数打印出来？
[2016-07-29]:老尹我们看郝老师写的笔记感觉挺好的 特别详细 你也能把笔记写详细一点 辛苦了
[2016-07-29]:希望上课的时候老师把xode放全屏，今天答应全屏的，然而你并没有做，只是把字体调大了 以后公司中从网络获取数据，都要按照今天的格式写吗？GCD的barrier没明白他的应用场景，能多说几个场景吗？在公司中使用的多吗？
    - barrier 阻塞  --> 多个线程对同一个线程不安全的资源进行操作的时候,可能会出问题,如果将对同一资源的操作放到barrier里面的话,那么barrier只会开1个线程对这个对象进行操作
        - 我没有用过
[2016-07-29]:建议老师不要在上午快放学和下午刚上课的时候讲复杂的知识点，那时候状态不是太好，容易犯蒙
[2016-07-29]:barrier有点没听明白，再简单讲一讲。
[2016-07-29]:可以能听懂
[2016-07-29]:有多少爱可以重来 望眼去 尹志平 尹天仇 你的兄弟找到了 加油 大兄弟 你可以的 神仙姐姐的事情我们不知道
[2016-07-29]:老师的五笔打字，用的真帅
[2016-07-29]:無
